# ชุดคำสั่ง 1 คั่นระหว่าง String
# >>> print("Hello", "Python")
# ผลลัพธ์ของชุดคำสั่ง 1 คือ 
"Hello Python"
# 1

# ชุดคำสั่ง 2 คั่นระหว่างจำนวน
# >>> print(34, 24, 35, 170.0)
# ผลลัพธ์ของชุดคำสั่ง 2 คือ 
"34 24 35 170.0"
# 1

# ชุดคำสั่ง 3 คั่นระหว่างข้อมูลต่างชนิด
# >>> print("I'm", 19, "years old")
# ผลลัพธ์ของชุดคำสั่ง 3 คือ 
"I'm 19 years old"
# 1

# ชุดคำสั่ง 4 คั่นระหว่างตัวแปร
# >>> a,b = 17,35
# >>> print(a, b)
# ผลลัพธ์ของชุดคำสั่ง 4 คือ 
"17 35"
# 1

# ส่ง keyword parameter sep เพื่อกำหนดอักขระอื่นแทนการเว้นช่องว่าง
# ชุดคำสั่ง 5 sep
# >>> print(34, 24, 35, 170.0, sep=',')
# ผลลัพธ์ของชุดคำสั่ง 5 คือ 
"34,24,35,170.0"
# 1

# ชุดคำสั่ง 6 sep
# >>> print(34, 24, 35, 170.0, sep='')
# ผลลัพธ์ของชุดคำสั่ง 6 คือ 
"342435170.0"
# 1

# ชุดคำสั่ง 7 sep
# >>> print("I'm", 19, "years old", sep='-:-')
# ผลลัพธ์ของชุดคำสั่ง 7 คือ 
"I'm-:-19-:-years old"
# 1

# ส่ง keyword parameter end เพื่อจบคำสั่ง print ด้วยอักขระอื่นแทนการขึ้นบรรทัดใหม่
# ให้ทดสอบคำสั่งต่อไปนี้ด้วย script mode แล้วตอบว่าแต่ละชุดคำสั่งให้ผลลัพธ์อะไร ชุดคำสั่ง 8 end
# print("I'm", end=' ')
# print(19, end='')
# print("yrs.", end='\n')
# ผลลัพธ์ของชุดคำสั่ง 8 คือ 
"I'm 19yrs."
# 1
